In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [4]:
np.random.seed(101)

In [13]:
df = pd.DataFrame(randn(5, 4), "A B C D E".split(), "W X Y Z".split())

In [14]:
df

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

In [16]:
df[["W", "Z"]]

          W         Z
A -1.467514  0.485809
B  0.392489  1.541990
C  0.666319  1.407338
D  0.641806  1.028293
E -1.972605 -1.223082

In [17]:
df.W

A   -1.467514
B    0.392489
C    0.666319
D    0.641806
E   -1.972605
Name: W, dtype: float64

In [19]:
type(df["W"])

pandas.core.series.Series

In [20]:
df["neu"] = df["W"] + df["Y"]

In [21]:
df

          W         X         Y         Z       neu
A -1.467514 -0.494095 -0.162535  0.485809 -1.630049
B  0.392489  0.221491 -0.855196  1.541990 -0.462707
C  0.666319 -0.538235 -0.568581  1.407338  0.097738
D  0.641806 -0.905100 -0.391157  1.028293  0.250649
E -1.972605 -0.866885  0.720788 -1.223082 -1.251818

In [26]:
df.drop("neu", 1)

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

In [27]:
df

          W         X         Y         Z       neu
A -1.467514 -0.494095 -0.162535  0.485809 -1.630049
B  0.392489  0.221491 -0.855196  1.541990 -0.462707
C  0.666319 -0.538235 -0.568581  1.407338  0.097738
D  0.641806 -0.905100 -0.391157  1.028293  0.250649
E -1.972605 -0.866885  0.720788 -1.223082 -1.251818

In [28]:
df.drop("neu", 1, inplace=True)

In [29]:
df

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

In [30]:
df.drop("E", 0)

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293

In [35]:
df.loc["A"]

W   -1.467514
X   -0.494095
Y   -0.162535
Z    0.485809
Name: A, dtype: float64

In [38]:
df.iloc[2]

W    0.666319
X   -0.538235
Y   -0.568581
Z    1.407338
Name: C, dtype: float64

In [41]:
df.loc["B", "Y"]

-0.8551960407780934

In [42]:
df.loc[["A", "B"], ["W", "Y"]]

          W         Y
A -1.467514 -0.162535
B  0.392489 -0.855196

In [27]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
df[df > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [29]:
df["W"] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [32]:
df[df["X"] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [34]:
df[df["W"]>0][["Y", "X", "Z"]]

          Y         X         Z
A  0.907969  0.628133  0.503826
B -0.848077 -0.319318  0.605965
D -0.933237 -0.758872  0.955057
E  2.605967  1.978757  0.683509

In [39]:
df[(df["W"] > 0) & (df["Y"] > 1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [40]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [41]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [42]:
neuind = "BY BW HH BB NW".split()

In [46]:
df["Staaten"] = neuind

In [61]:
df

          W         X         Y         Z Staaten
A  2.706850  0.628133  0.907969  0.503826      BY
B  0.651118 -0.319318 -0.848077  0.605965      BW
C -2.018168  0.740122  0.528813 -0.589001      HH
D  0.188695 -0.758872 -0.933237  0.955057      BB
E  0.190794  1.978757  2.605967  0.683509      NW

In [62]:
df.set_index("Staaten")

                W         X         Y         Z
Staaten
BY       2.706850  0.628133  0.907969  0.503826
BW       0.651118 -0.319318 -0.848077  0.605965
HH      -2.018168  0.740122  0.528813 -0.589001
BB       0.188695 -0.758872 -0.933237  0.955057
NW       0.190794  1.978757  2.605967  0.683509

In [63]:
df

          W         X         Y         Z Staaten
A  2.706850  0.628133  0.907969  0.503826      BY
B  0.651118 -0.319318 -0.848077  0.605965      BW
C -2.018168  0.740122  0.528813 -0.589001      HH
D  0.188695 -0.758872 -0.933237  0.955057      BB
E  0.190794  1.978757  2.605967  0.683509      NW

In [65]:
df.set_index("Staaten", inplace=True)

In [66]:
df

                W         X         Y         Z
Staaten
BY       2.706850  0.628133  0.907969  0.503826
BW       0.651118 -0.319318 -0.848077  0.605965
HH      -2.018168  0.740122  0.528813 -0.589001
BB       0.188695 -0.758872 -0.933237  0.955057
NW       0.190794  1.978757  2.605967  0.683509

In [68]:
aussen = ["G1", "G1", "G1", "G2", "G2", "G2"]
innen = [1,2,3,1,2,3]
hier_index = list(zip(aussen, innen))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [69]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [70]:
df = pd.DataFrame(np.random.randn(6, 2), hier_index, ["A", "B"])

In [71]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [75]:
df.loc["G1"].loc[2]

A   -1.706086
B   -1.159119
Name: 2, dtype: float64

In [77]:
df.index.names = ["Gruppe", "Num"]

In [78]:
df

                   A         B
Gruppe Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [82]:
df.xs(["G1", 1])

A    0.302665
B    1.693723
Name: (G1, 1), dtype: float64

In [85]:
df.xs(1, level="Num")

               A         B
Gruppe
G1      0.302665  1.693723
G2      0.166905  0.184502